phatpaul/ArduinoCore-LPC8xx/boards.txt
menu.upload_method=Upload Method

lpc845brk.name=NXP LPC845-BRK
lpc845brk.upload.tool=openocd
lpc845brk.upload.protocol=cmsis-dap
lpc845brk.upload.maximum_size=65536
lpc845brk.upload.maximum_data_size=16384
lpc845brk.upload.speed=1000
lpc845brk.build.mcu=cortex-m0plus
lpc845brk.build.f_cpu=30000000L
lpc845brk.build.board=LPC845BRK
lpc845brk.build.core=lpc8xx
lpc845brk.build.variant=lpc845brk
lpc845brk.build.ldscript=linker_scripts/gcc/lpc845_flash.ld
lpc845brk.build.openocd_target=target/lpc84x.cfg
lpc845brk.build.extra_flags=-DCPU_LPC845M301JBD48 -D__LPC845__ -DLPC845 -DARDUINO_LPC845BRK
lpc845brk.menu.upload_method.cmsis_dap=CMSIS-DAP / OpenOCD
lpc845brk.menu.upload_method.cmsis_dap.upload.tool=openocd
lpc845brk.menu.upload_method.cmsis_dap.upload.protocol=cmsis-dap
lpc845brk.menu.upload_method.isp=Manual ISP fallback
lpc845brk.menu.upload_method.isp.upload.tool=manual_isp
lpc845brk.menu.upload_method.isp.upload.protocol=isp

lpcxpresso804.name=NXP LPCXpresso804
lpcxpresso804.upload.tool=openocd
lpcxpresso804.upload.protocol=cmsis-dap
lpcxpresso804.upload.maximum_size=32768
lpcxpresso804.upload.maximum_data_size=4096
lpcxpresso804.upload.speed=1000
lpcxpresso804.build.mcu=cortex-m0plus
lpcxpresso804.build.f_cpu=15000000L
lpcxpresso804.build.board=LPCXPRESSO804
lpcxpresso804.build.core=lpc8xx
lpcxpresso804.build.variant=lpcxpresso804
lpcxpresso804.build.ldscript=linker_scripts/gcc/lpc804_flash.ld
lpcxpresso804.build.openocd_target=target/lpc8xx.cfg
lpcxpresso804.build.extra_flags=-DCPU_LPC804M101JDH24 -D__LPC804__ -DLPC804 -DARDUINO_LPCXPRESSO804
lpcxpresso804.menu.upload_method.cmsis_dap=CMSIS-DAP / OpenOCD
lpcxpresso804.menu.upload_method.cmsis_dap.upload.tool=openocd
lpcxpresso804.menu.upload_method.cmsis_dap.upload.protocol=cmsis-dap
lpcxpresso804.menu.upload_method.isp=Manual ISP fallback
lpcxpresso804.menu.upload_method.isp.upload.tool=manual_isp
lpcxpresso804.menu.upload_method.isp.upload.protocol=isp

lpcxpresso845max.name=NXP LPCXpresso845-MAX
lpcxpresso845max.upload.tool=openocd
lpcxpresso845max.upload.protocol=cmsis-dap
lpcxpresso845max.upload.maximum_size=65536
lpcxpresso845max.upload.maximum_data_size=16384
lpcxpresso845max.upload.speed=1000
lpcxpresso845max.build.mcu=cortex-m0plus
lpcxpresso845max.build.f_cpu=30000000L
lpcxpresso845max.build.board=LPCXPRESSO845MAX
lpcxpresso845max.build.core=lpc8xx
lpcxpresso845max.build.variant=lpcxpresso845max
lpcxpresso845max.build.ldscript=linker_scripts/gcc/lpc845_flash.ld
lpcxpresso845max.build.openocd_target=target/lpc84x.cfg
lpcxpresso845max.build.extra_flags=-DCPU_LPC845M301JBD64 -D__LPC845__ -DLPC845 -DARDUINO_LPCXPRESSO845MAX
lpcxpresso845max.menu.upload_method.cmsis_dap=CMSIS-DAP / OpenOCD
lpcxpresso845max.menu.upload_method.cmsis_dap.upload.tool=openocd
lpcxpresso845max.menu.upload_method.cmsis_dap.upload.protocol=cmsis-dap
lpcxpresso845max.menu.upload_method.isp=Manual ISP fallback
lpcxpresso845max.menu.upload_method.isp.upload.tool=manual_isp
lpcxpresso845max.menu.upload_method.isp.upload.protocol=isp
